docs/example_aa_request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Body>
        <Request xmlns="urn:oasis:names:tc:SAML:1.0:protocol" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion"
                 xmlns:samlp="urn:oasis:names:tc:SAML:1.0:protocol" IssueInstant="2020-02-23T18:10:14.341Z"
                 MajorVersion="1" MinorVersion="1" RequestID="a2f5ab4ff02352de7766b31f23fe29e9">
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod
                            Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod>
                    <ds:Reference URI="#a2f5ab4ff02352de7766b31f23fe29e9">
                        <ds:Transforms>
                            <ds:Transform
                                    Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"></ds:Transform>
                            <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                                <ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
                                                        PrefixList="code ds kind rw saml samlp typens #default"></ec:InclusiveNamespaces>
                            </ds:Transform>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
                        <ds:DigestValue>3cO7Dnj5LrM++87zbA6WNUeWBTA=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>
                    n2vsk6a3LDWrEpKYub9mQUmK9dEEVLLrJt5PAGvubOhzxGu+KO3INb2KbB52hntFg2J/ukaAHEqC
                    55mQ020W8Nv3gAjSP6dBIejXPR69ydo+h4GKz/2Yrx1g4ARwpb6+avYkb8iiC19UKuKa18rE+oMy
                    Ky2yKpHV/29gj01du1IEIrHtg82VIvv8PNg2Kou+SSwOgYKhH14tfZGcLTH81BmHTZzihR+f4DB1
                    TQLH01fgmQmRwTTrekkpWoReBoM0dUX4GcwR1JfVpBp5tuWemQvhNuNSRk+yl9lt0kuTFJwYahZo
                    6HWMgS6Rd3uZGHIMETxcZh8PeSt1LgqdQDGhgQ==
                </ds:SignatureValue>
                <ds:KeyInfo>
                    <ds:X509Data>
                        <ds:X509Certificate>
                            MIIGHzCCBQegAwIBAgISA5BUzDCsAXR3CfZy+bz9c3ocMA0GCSqGSIb3DQEBCwUAMEoxCzAJBgNV
                            BAYTAlVTMRYwFAYDVQQKEw1MZXQncyBFbmNyeXB0MSMwIQYDVQQDExpMZXQncyBFbmNyeXB0IEF1
                            dGhvcml0eSBYMzAeFw0xODA5MjQxMTExMjhaFw0xODEyMjMxMTExMjhaMCUxIzAhBgNVBAMTGmZy
                            YW5rZW5zdGVpbi53YXJ3aWNrLmFjLnVrMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA
                            oeWdrJ+4cwspFZM5/Xgjt6sRh10BdxQG1fSJN3n3BWFOjZId0tH2Fl1lgdvoxaFNOmSREJVp7QvC
                            w3CWMKoXUy+8oYLrvuvinNcpQxhQLd06d5Ea/9dchoxgeTCoyjDJ/FKXkD39hraWi5/0I6VTDdzY
                            7PFGLXJFaxfMYkj3a40vZFnIH+N9zmT17fGs0VEtrEOWco0mA/4vT1o65vIJDWNpy84j24tIu8Ye
                            QfQAv0C1FU9gh3Mocj90DMh1KAqpDxJgVLeU2F/sA/Yx5e6WtlMdFK45kKas+sKaGmRDVGI+R9l5
                            tv+zXQ4ZZxIEg9Cd89Eg1xzuX0nnvWSdBZNuAwIDAQABo4IDIjCCAx4wDgYDVR0PAQH/BAQDAgWg
                            MB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjAMBgNVHRMBAf8EAjAAMB0GA1UdDgQWBBSX
                            Pa345vhIoX5l2RkUBYIyT6AdSjAfBgNVHSMEGDAWgBSoSmpjBH3duubRObemRWXv86jsoTBvBggr
                            BgEFBQcBAQRjMGEwLgYIKwYBBQUHMAGGImh0dHA6Ly9vY3NwLmludC14My5sZXRzZW5jcnlwdC5v
                            cmcwLwYIKwYBBQUHMAKGI2h0dHA6Ly9jZXJ0LmludC14My5sZXRzZW5jcnlwdC5vcmcvMCUGA1Ud
                            EQQeMByCGmZyYW5rZW5zdGVpbi53YXJ3aWNrLmFjLnVrMIH+BgNVHSAEgfYwgfMwCAYGZ4EMAQIB
                            MIHmBgsrBgEEAYLfEwEBATCB1jAmBggrBgEFBQcCARYaaHR0cDovL2Nwcy5sZXRzZW5jcnlwdC5v
                            cmcwgasGCCsGAQUFBwICMIGeDIGbVGhpcyBDZXJ0aWZpY2F0ZSBtYXkgb25seSBiZSByZWxpZWQg
                            dXBvbiBieSBSZWx5aW5nIFBhcnRpZXMgYW5kIG9ubHkgaW4gYWNjb3JkYW5jZSB3aXRoIHRoZSBD
                            ZXJ0aWZpY2F0ZSBQb2xpY3kgZm91bmQgYXQgaHR0cHM6Ly9sZXRzZW5jcnlwdC5vcmcvcmVwb3Np
                            dG9yeS8wggEEBgorBgEEAdZ5AgQCBIH1BIHyAPAAdgBvU3asMfAxGdiZAKRRFf93FRwR2QLBACkG
                            jbIImjfZEwAAAWYLfda5AAAEAwBHMEUCIQCxA3J0TbVUsoB2sTPkax2qNjmjj6kV82EwIQ0UjIYp
                            PwIganEVUHEn3w3q94DBFboOaOZKJOJKG8UfbmcxCmghlMEAdgApPFGWVMg5ZbqqUPxYB9S3b79Y
                            eily3KTDDPTlRUf0eAAAAWYLfdd4AAAEAwBHMEUCIQC9WKW1D1I6yFPw9yn5k87jpz9gmWZxObzw
                            76FolOGTLgIgd9ryTKv3aBkNRIhFGm1Hzr4f5JIk/VdYTMcwpcbIpSEwDQYJKoZIhvcNAQELBQAD
                            ggEBAHITkOtbBaTeR0pFfzaEsiu8UaiY3WlK2ffOdZ2OZ++/o5KnilTeZEMfhl/eYXdeHy/47QNv
                            UOAGuKaIVI/JI1gE90jp9D02JeM0aVjEUPJShHJpnbcRYQgkDHcHiYKafvDRwowpNrf6cG+J2hPH
                            23nFH6cDrCRqB5reGCKzE3Fs4SC3ZNA6WSBn0Viq16vngI5HHSoIsMvJv6UGLrk6AXvPPcs6zdqw
                            dS526ol/xIwojVEDve33CnUwUKbGtX0JZ3Ffzbtoh5NvRmVvQpGQA1V4MKvDUMsUIYIJGpkWtkDQ
                            lGgVEqQ+nA/MJvMUOqEVAQawZINXk199gZFEwPjgCLY=
                        </ds:X509Certificate>
                    </ds:X509Data>
                </ds:KeyInfo>
            </ds:Signature>
            <AttributeQuery Resource="urn:frankenstein.warwick.ac.uk:service">
                <Subject xmlns="urn:oasis:names:tc:SAML:1.0:assertion">
                    <NameIdentifier Format="urn:websignon:uuid">4200001</NameIdentifier>
                    <SubjectConfirmation>
                        <ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:bearer</ConfirmationMethod>
                    </SubjectConfirmation>
                </Subject>
            </AttributeQuery>
        </Request>
    </soap:Body>
</soap:Envelope>